# OptionSetId Property (2024)

---
C#Visual BasicVisual C++
Revit 2024 API
---
ParameterTypeId..::..OptionSetId Property
ParameterTypeId Class See Also
---
"Design Option Set Id"
**Namespace:** Autodesk.Revit.DB**Assembly:** RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
# Syntax
C#
---
```text
public static ForgeTypeId OptionSetId { get; }
```

Visual Basic
---
```text
Public Shared ReadOnly Property OptionSetId As ForgeTypeId
	Get
```

Visual C++
---
```text
public:
static property ForgeTypeId^ OptionSetId {
	ForgeTypeId^ get ();
}
```

# See Also
ParameterTypeId Class
Autodesk.Revit.DB Namespace